[
    {"stage": 1, "question": "What initially drew you to your Christian faith?"},
    {"stage": 1, "question": "Can you share a significant moment when your faith was tested, and how did you overcome it?"},
    {"stage": 1, "question": "How do you find inspiration in your daily life to strengthen your faith?"},
    {"stage": 1, "question": "What Bible verse has had the most impact on your life, and why?"},
    {"stage": 1, "question": "Describe a time when you felt God's presence most strongly in your life."},
    {"stage": 1, "question": "What role does prayer play in your relationship with God?"},
    {"stage": 1, "question": "How has your faith shaped your values and decision-making?"},
    {"stage": 1, "question": "Share a Christian song or hymn that has a special place in your heart, and explain why."},
    {"stage": 1, "question": "Discuss a Christian author or theologian who has influenced your spiritual journey."},
    {"stage": 1, "question": "How do you incorporate acts of service and kindness into your Christian walk?"},
    {"stage": 1, "question": "What is your favorite Bible story, and what lessons do you draw from it?"},
    {"stage": 1, "question": "How do you practice gratitude as part of your faith journey?"},
    {"stage": 1, "question": "What role does fellowship with other Christians play in your spiritual growth?"},
    {"stage": 1, "question": "Share a personal testimony of a time when your faith made a tangible difference in your life."},
    {"stage": 1, "question": "How do you seek to live out the teachings of Jesus in your daily life?"},
  
    {"stage": 2, "question": "In your opinion, what are the key elements of a strong Christian community?"},
    {"stage": 2, "question": "Describe a time when you felt a deep connection with a fellow Christian. What made it special?"},
    {"stage": 2, "question": "How do you navigate conflicts or disagreements within your faith community?"},
    {"stage": 2, "question": "Share a personal story of how your faith has positively impacted one of your relationships."},
    {"stage": 2, "question": "Discuss a Christian mentor or role model who has influenced your spiritual growth."},
    {"stage": 2, "question": "What are your favorite ways to actively support and encourage fellow believers?"},
    {"stage": 2, "question": "How do you balance your faith with the challenges of everyday life?"},
    {"stage": 2, "question": "Share a moment when your faith provided comfort during a difficult situation."},
    {"stage": 2, "question": "How do you envision your faith influencing your future relationships and family life?"},
    {"stage": 2, "question": "What is the most important lesson you've learned through your Christian relationships?"},
    {"stage": 2, "question": "What role does forgiveness and reconciliation play in your Christian walk?"},
    {"stage": 2, "question": "How do you practice humility and servanthood in your interactions with others?"},
    {"stage": 2, "question": "Share a story of a time when you felt the presence of the Holy Spirit during a communal worship experience."},
    {"stage": 2, "question": "How do you foster a sense of unity and fellowship within your church or faith community?"},
    {"stage": 2, "question": "What are your favorite ways to engage in acts of kindness and compassion within your community?"},
  
    {"stage": 3, "question": "What do you believe is your God-given purpose in life, and how are you pursuing it?"},
    {"stage": 3, "question": "Share an experience where you felt called to serve or make a positive impact in your community."},
    {"stage": 3, "question": "How do you handle doubt or moments of spiritual dryness in your Christian journey?"},
    {"stage": 3, "question": "Describe a time when your faith led you to take a courageous step outside your comfort zone."},
    {"stage": 3, "question": "What does living out your faith look like in your career or daily work?"},
    {"stage": 3, "question": "Discuss a Christian organization or cause that you're passionate about supporting."},
    {"stage": 3, "question": "How do you see your faith shaping your goals and aspirations for the future?"},
    {"stage": 3, "question": "Share a personal mission statement or motto that reflects your Christian values."},
    {"stage": 3, "question": "How do you hope to leave a lasting legacy of faith for future generations?"},
    {"stage": 3, "question": "What role do forgiveness and reconciliation play in your Christian walk?"},
    {"stage": 3, "question": "Discuss a Christian leader or historical figure who inspires you in your faith journey."},
    {"stage": 3, "question": "How do you discern God's will and direction for your life?"},
    {"stage": 3, "question": "Share a story of a time when you experienced a breakthrough in your faith journey."},
    {"stage": 3, "question": "How do you incorporate worship and praise into your daily routine?"},
    {"stage": 3, "question": "What role does gratitude and contentment play in your pursuit of God's purpose for your life?"}
  ]