[
    {"stage": 1, "question": "What ministry do you think I would do very well in?"},
    {"stage": 1, "question": "How do you think your friends would describe your walk with Christ?"},
    {"stage": 1, "question": "If my faith were a book, what would the title be?"},
    {"stage": 1, "question": "Which Christian song or hymn shares a special place in your heart and why?"},
    {"stage": 1, "question": "What is the best greeting time question you've heard?"},
    {"stage": 1, "question": "If I was called to church discipline, what do you think it would be for?"},
    {"stage": 1, "question": "If I went on a mission trip, what top 5 things do you think I would bring?"},
    {"stage": 1, "question": "What do you think I spend most of my time doing?"},
    {"stage": 1, "question": "Do you think I was popular in school? Explain."},
    {"stage": 1, "question": "Do I seem like someone who would enter into full time ministry? Explain why or why not."},
    {"stage": 1, "question": "Look at my most recently-liked Christian song. What does it tell you about me?"},
    {"stage": 1, "question": "What was your first impression of me?"},
    {"stage": 1, "question": "What do you wish you knew about me?"},
    {"stage": 1, "question": "Do I remind you of anyone (from church or from the Bible)?"},
    {"stage": 1, "question": "Tell me something about yourself that nobody would guess just by looking at you."},
    {"stage": 1, "question": "What is the first thing you noticed about me?"},
    {"stage": 1, "question": "Which book of the Bible do you think I enjoy reading the most?"},
    {"stage": 1, "question": "What Christmas present do you think I would appreciate?"},
    {"stage": 1, "question": "Do I seem like a first-generation Christian? Why or why not?"},
    {"stage": 1, "question": "What do you think my love languages are?"},
    {"stage": 1, "question": "Share your favourite part of church service."},
    {"stage": 1, "question": "What do you think I've been complimented about very often?"},
    {"stage": 1, "question": "Faith, hope, and love. Which one do you think I excel at the most?"},
    {"stage": 1, "question": "If I brought a snack to church, what do you think it would be?"},
    {"stage": 1, "question": "What do you think my appearance tells you about my faith?"},
    {"stage": 1, "question": "Do I seem like someone who will study the Bible more, or go out and carry out deeds of faith more? Why?"},
    {"stage": 1, "question": "Describe me in 3 words."},

    {"stage": 2, "question": "What would a younger you be impressed about with your faith today?"},
    {"stage": 2, "question": "Describe a turning point of your Christian faith."},
    {"stage": 2, "question": "What false or inaccurate beliefs have you had to give up? How did you do it?"},
    {"stage": 2, "question": "What would you say to someone who is discouraged and downtrodden in their faith?"},
    {"stage": 2, "question": "What is a Bible verse that has had a huge impact on your life, and why?"},
    {"stage": 2, "question": "Describe a time when you felt God's presence most strongly in your life."},
    {"stage": 2, "question": "How is your relationship with God? Be honest."},
    {"stage": 2, "question": "What is the most challenging thing about being a Christian in your life now?"},
    {"stage": 2, "question": "Share a Christian author or theologian who has influenced your spiritual journey."},
    {"stage": 2, "question": "What aspect of faith are you still struggling with or doubting about?"},
    {"stage": 2, "question": "Describe a church-related experience that has made a huge impact or impression on you."},
    {"stage": 2, "question": "How would you disagree with a fellow Christian and still show them love?"},
    {"stage": 2, "question": "Be honest. What ticks you off about some Christians?"},
    {"stage": 2, "question": "Share a time when you felt disconnected from identifying as a Christian. What happened?"},
    {"stage": 2, "question": "Was there a time that you were judged for your faith? Describe the situation."},
    {"stage": 2, "question": "Share one thing you wish your church did differently."},
    {"stage": 2, "question": "What are some things that you are doing to build the church?"},
    {"stage": 2, "question": "What do you believe is your God-given purpose in life, and how are you acting on it?"},
    {"stage": 2, "question": "What was the most uncomfortable thing you have had to do for your faith?"},
    {"stage": 2, "question": "What does living out your faith look like in your career or daily work?"},
    {"stage": 2, "question": "What legacy do you wish to leave in your church?"},
    {"stage": 2, "question": "Discuss a Christian organization or cause that you're passionate about supporting."},
    {"stage": 2, "question": "What is something you wish your church learned from the external world?"},
    {"stage": 2, "question": "Is there a faith activity that you only do with Christians, but never do by yourself in secret? Why?"},
    {"stage": 2, "question": "Have you ever lied to a minister or a church leader? Explain."},
    {"stage": 2, "question": "What do you look out for in a Christian partner?"},
    {"stage": 2, "question": "What are some traits that you dislike about a person?"},
    {"stage": 2, "question": "Which traits from your parents do you want to keep / let go?"},
    {"stage": 2, "question": "How would you raise your child to know God?"},
    {"stage": 2, "question": "What is a past sin of yours that brings feelings of guilt and shame?"},

    {"stage": 3, "question": "If we were to work together in a ministry, which one would it be?"},
    {"stage": 3, "question": "What about me has surprised you so far?"},
    {"stage": 3, "question": "What do you think I need to hear right now?"},
    {"stage": 3, "question": "What do you think God wants me to know right now?"},
    {"stage": 3, "question": "Has anything about my faith encouraged you? Elaborate."},
    {"stage": 3, "question": "What would you like prayer for?"},
    {"stage": 3, "question": "What am I most qualified to give advice about?"},
    {"stage": 3, "question": "What aspects of faith do you think we share?"},
    {"stage": 3, "question": "What have you learned from this conversation?"},
    {"stage": 3, "question": "How do you see me contributing to God's kingdom?"},
    {"stage": 3, "question": "What is one thing you wish more people knew about me?"},
    {"stage": 3, "question": "What would help you feel closer to me?"},
    {"stage": 3, "question": "How can I help you?"},
    {"stage": 3, "question": "What kind of people do you see me reaching for Christ?"},
    {"stage": 3, "question": "What do you think God's calling is for my life?"},
    {"stage": 3, "question": "Activity: Take a selfie together to remember this moment."},
    {"stage": 3, "question": "What are you grateful to God for right now?"},
    {"stage": 3, "question": "What do you need right now, but are too afraid to ask for?"},
    {"stage": 3, "question": "Which part of your life is going well right now?"},
    {"stage": 3, "question": "How has God blessed you this past year?"},
    {"stage": 3, "question": "What are you working out in your faith right now that others do not see? How can I help?"},
    {"stage": 3, "question": "Fill in the blanks: I feel loved when ___."},
    {"stage": 3, "question": "How would you describe me to a stranger?"}
  ]